import{i as n,o as i,m as s}from"./index-CsGh1sZ3.js";const p={__name:"Mantra",setup(e){const a=[{title:"常颂经咒-序言",text:`
    <center style="font-size: 16px">
      <img src="/icons/favicon.svg" style="width: 128px;" />
      <h3>佛经与咒言  从本质上说  都是佛教的修行法门</h3>其目的都是 <span class="highlight">教世人如何 出离世间苦海  成就佛道</span> 

      "咒言" 并不是佛教的发明  而是古印度社会传统的产物  
      也就是说 在古印度 持"咒"的教派很普遍 
      佛教本身也是在这样的基础上 才有持"咒"这一说法  
        
      而佛教中的"咒"与"经"的不同 往往表现在以下这三个方面  

      <span class="highlight">一是"咒"其实是"经"的浓缩版  也是"经"的精华所在</span>
      在佛教中  常有一种说法  即六百卷的般若经  其精华都浓缩在一部名叫《无量寿经》当中  
      而《无量寿经》的精华都浓缩在一句佛号当中  即 <span class="highlight">阿弥陀佛</span>  
        
      <span class="highlight">二是佛教中的"咒"往往是音译  而不同于"经"的意译</span>
      因为"咒言"一旦意译  其意尽失  无法表达其原有的丰富内涵  
      这也是译师们在译经时  遇到"咒"往往不直译的真正原因  
        
      <span class="highlight">三是相对于"咒"而言  "经"更像是"咒"的传  即诠释 </span>
      因此  念经和念咒或持咒和持咒并不是完全相同  因为"咒"的本身含有更多丰富的内容  
      这是"经"无法比拟的  甚至可以说  
      一部"经"只是诠释"咒"的一种角度  有多部"经"就是多种角度  
    </center>`,note:"",audio:""},{title:"六字大明咒",text:`<center style="margin: 100px;">
      ōng má ní bā mī hōng
      唵 嘛 呢 叭 咪 吽
    </center>
    `,note:`
      (1)普通念诵此咒,神妙殊胜,非可言喻。无论男女老幼,富贵贫贱,皆可念诵,遍数越多越好,以满十万遍为最小限度；每次至少一百零八遍,行、住、坐、卧,皆可。但须身心清净,忌葱蒜荤腥等。又应发菩提心、大悲心,至诚皈依观世音菩萨,心缘一境,不可散乱,久久行之,祸乱悉免,祈求无不如意。……能救世人病苦,是离苦得乐的良药。
      
      (2)念诵此咒,能治诸多魔障,能除诸多损害,能消诸多恶劫,能得各种成就,能净诸障,……
      
      (3)念诵此咒一遍至七遍,能净百千亿劫所集罪障；念百遍或者千遍,等于念一切藏经功德；念万遍,能断三恶道门；念百万遍,能得不退转地；念千万遍,当于法身、受用身、应身、自性身,证菩提身,而得成佛。此外,尚有使贫者得富,贱者得贵等等持诵功德。
      
      以上注释见《白普仁喇嘛传六字大明咒简法》及《观音心咒持诵功德表》。
    `,audio:"/audios/六字大明咒.mp3"},{title:"绿度母心咒",text:`
      ong
      嗡
      
      da lie
      大咧
      
      du da lie 
      度大咧
      
      du lie suo ha
      度咧蘇哈
    `,note:`绿度母为观世音菩萨的化身。度母,梵名Tara,全称圣救度佛母,我国古代称多罗菩萨、多罗观音,共有二十一尊,皆为观世音菩萨之化身。
      修持此尊密法,能断生死轮回,消除一切魔障、业障、病苦等,并能消灾、增福、延寿、广开智慧,凡有所求,无不如愿成就,且命终往生极乐世界。
    `,audio:"/audios/绿度母心咒.mp3"},{title:"药师佛心咒",text:`
      die ya ta     
      喋雅他 
      
      ong
      嗡 
      
      bei kan ze bei kan ze
      贝堪则 贝堪则 
      
      ma ha bei kan ze
      玛哈贝堪则 
      
      la za sa mu 
      喇杂萨目 
      
      ga die
      嘎喋 
      
      so ha 
      梭哈
    
    `,note:"在密宗佛教中特别是东密佛教有以石碑护身符制作符咒保护别人平安健康。药师佛心咒：石碑护身符组成“红蚕石、靛蓝晶、影子石、蜜蜡石、云海石”。药师佛心咒石碑护身符可以保护平安健康，化解人生中的凶煞。",audio:"/audios/药师佛心咒.mp3"},{title:"准提咒",text:`
      nā mó sà duō nan
      南无飒哆喃
      
      sān miǎo sān pú tuó
      三藐三菩陀
      
      jù zhī nan
      俱胝喃
      
      dá zhí tuō
      怛侄他
      
      ōng zhé lì zhǔ lì
      唵 折戾主戾 
      
      zhǔn tí suō pó hē
      准提娑婆诃
    `,note:"“准提”汉译为“清净”，即赞叹心性清净之称。 佛言∶若一心静思诵此咒，满九十万遍，无量劫造十恶五逆，四重五无间罪，悉皆消灭，所生之处，常遇菩萨，丰饶财宝，诵满二十六万遍，乃至四十六万遍，世出世法，无不称遂，便于梦中，见佛菩萨，及以花果，口吐黑物，饮吃白物，即知成就。",audio:"/audios/准提咒.mp3"},{title:"阿弥陀佛心咒",text:`
      《阿弥陀佛一字心咒》

      ōng à mí diē wā shē
      嗡 阿弥德瓦 舍
      Om Amitabha hrih

      《阿弥陀佛大乐心咒》

      ōng ā mī dē wǎ ā yī sī dé hòng shē
      嗡 阿弥德瓦 阿耶 悉地 吽 舍
      Om Amitabha Arya Siddhi Hum Hrih
    `,note:`阿弥陀佛一字心咒是阿弥陀佛摄引众生往生极乐世界的心咒，也叫弥陀心印，持诵可灭除厄难业障，命终蒙佛接引往生极乐世界，且可得上品上生。

      阿弥陀佛是法界藏身，一佛等于一切佛，所以南无阿弥陀佛名号蕴藏着阿弥陀佛的功德，也就等于蕴藏着十方三世一切诸佛的功德，所以念这句名号就等于念到了一切诸佛所有的一切，所以这就叫万德洪名。
    `,audio:"/audios/阿弥陀佛心咒.mp3"}];return(o,h)=>{const t=s;return i(),n(t,{articles:a,options:{mantra:!0},class:"font-family-app"})}}};export{p as default};
